app/controllers/pins_controller.rb

  def create
    @pin = Pin.new(pin_params)
    @pin.save
---
INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", ""], ["user_id", 1], ["created_at", "2015-01-19 21:13:11.674527"], ["updated_at", "2015-01-19 21:13:11.674527"]]